/* automatically generated by rust-bindgen 0.60.1 */

#[doc = " @brief The representation of an abl_link instance"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct abl_link {
    pub impl_: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_abl_link() {
    assert_eq!(
        ::std::mem::size_of::<abl_link>(),
        8usize,
        concat!("Size of: ", stringify!(abl_link))
    );
    assert_eq!(
        ::std::mem::align_of::<abl_link>(),
        8usize,
        concat!("Alignment of ", stringify!(abl_link))
    );
    fn test_field_impl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<abl_link>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(abl_link),
                "::",
                stringify!(impl_)
            )
        );
    }
    test_field_impl();
}
extern "C" {
    #[doc = " @brief Construct a new abl_link instance with an initial tempo."]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: no"]
    pub fn abl_link_create(bpm: f64) -> abl_link;
}
extern "C" {
    #[doc = " @brief Delete an abl_link instance."]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: no"]
    pub fn abl_link_destroy(link: abl_link);
}
extern "C" {
    #[doc = " @brief Is Link currently enabled?"]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: yes"]
    pub fn abl_link_is_enabled(link: abl_link) -> bool;
}
extern "C" {
    #[doc = " @brief Enable/disable Link."]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: no"]
    pub fn abl_link_enable(link: abl_link, enable: bool);
}
extern "C" {
    #[doc = " @brief: Is start/stop synchronization enabled?"]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: no"]
    pub fn abl_link_is_start_stop_sync_enabled(link: abl_link) -> bool;
}
extern "C" {
    #[doc = " @brief: Enable start/stop synchronization."]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: no"]
    pub fn abl_link_enable_start_stop_sync(link: abl_link, enabled: bool);
}
extern "C" {
    #[doc = " @brief How many peers are currently connected in a Link session?"]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: yes"]
    pub fn abl_link_num_peers(link: abl_link) -> u64;
}
#[doc = " @brief Register a callback to be notified when the number of"]
#[doc = "  peers in the Link session changes."]
#[doc = "  Thread-safe: yes"]
#[doc = "  Realtime-safe: no"]
#[doc = ""]
#[doc = "  @discussion The callback is invoked on a Link-managed thread."]
pub type abl_link_num_peers_callback = ::std::option::Option<
    unsafe extern "C" fn(num_peers: u64, context: *mut ::std::os::raw::c_void),
>;
extern "C" {
    pub fn abl_link_set_num_peers_callback(
        link: abl_link,
        callback: abl_link_num_peers_callback,
        context: *mut ::std::os::raw::c_void,
    );
}
#[doc = " @brief Register a callback to be notified when the session"]
#[doc = "  tempo changes."]
#[doc = "  Thread-safe: yes"]
#[doc = "  Realtime-safe: no"]
#[doc = ""]
#[doc = "  @discussion The callback is invoked on a Link-managed thread."]
pub type abl_link_tempo_callback =
    ::std::option::Option<unsafe extern "C" fn(tempo: f64, context: *mut ::std::os::raw::c_void)>;
extern "C" {
    pub fn abl_link_set_tempo_callback(
        link: abl_link,
        callback: abl_link_tempo_callback,
        context: *mut ::std::os::raw::c_void,
    );
}
#[doc = " brief: Register a callback to be notified when the state of"]
#[doc = "  start/stop isPlaying changes."]
#[doc = "  Thread-safe: yes"]
#[doc = "  Realtime-safe: no"]
#[doc = ""]
#[doc = "  @discussion The callback is invoked on a Link-managed thread."]
pub type abl_link_start_stop_callback = ::std::option::Option<
    unsafe extern "C" fn(is_playing: bool, context: *mut ::std::os::raw::c_void),
>;
extern "C" {
    pub fn abl_link_set_start_stop_callback(
        link: abl_link,
        callback: abl_link_start_stop_callback,
        context: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " brief: Get the current link clock time in microseconds."]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: yes"]
    pub fn abl_link_clock_micros(link: abl_link) -> i64;
}
#[doc = " @brief The representation of the current local state of a client in a Link Session"]
#[doc = ""]
#[doc = "  @discussion A session state represents a timeline and the start/stop"]
#[doc = "  state. The timeline is a representation of a mapping between time and"]
#[doc = "  beats for varying quanta. The start/stop state represents the user"]
#[doc = "  intention to start or stop transport at a specific time. Start stop"]
#[doc = "  synchronization is an optional feature that allows to share the user"]
#[doc = "  request to start or stop transport between a subgroup of peers in a"]
#[doc = "  Link session. When observing a change of start/stop state, audio"]
#[doc = "  playback of a peer should be started or stopped the same way it would"]
#[doc = "  have happened if the user had requested that change at the according"]
#[doc = "  time locally. The start/stop state can only be changed by the user."]
#[doc = "  This means that the current local start/stop state persists when"]
#[doc = "  joining or leaving a Link session. After joining a Link session"]
#[doc = "  start/stop change requests will be communicated to all connected peers."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct abl_link_session_state {
    pub impl_: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_abl_link_session_state() {
    assert_eq!(
        ::std::mem::size_of::<abl_link_session_state>(),
        8usize,
        concat!("Size of: ", stringify!(abl_link_session_state))
    );
    assert_eq!(
        ::std::mem::align_of::<abl_link_session_state>(),
        8usize,
        concat!("Alignment of ", stringify!(abl_link_session_state))
    );
    fn test_field_impl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<abl_link_session_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(abl_link_session_state),
                "::",
                stringify!(impl_)
            )
        );
    }
    test_field_impl();
}
extern "C" {
    #[doc = " @brief Create a new session_state instance."]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: no"]
    #[doc = ""]
    #[doc = "  @discussion The session_state is to be used with the abl_link_capture... and"]
    #[doc = "  abl_link_commit... functions to capture snapshots of the current link state and pass"]
    #[doc = "  changes to the link session."]
    pub fn abl_link_create_session_state() -> abl_link_session_state;
}
extern "C" {
    #[doc = " @brief Delete a session_state instance."]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: no"]
    pub fn abl_link_destroy_session_state(abl_link_session_state: abl_link_session_state);
}
extern "C" {
    #[doc = " @brief Capture the current Link Session State from the audio thread."]
    #[doc = "  Thread-safe: no"]
    #[doc = "  Realtime-safe: yes"]
    #[doc = ""]
    #[doc = "  @discussion This function should ONLY be called in the audio thread and must not be"]
    #[doc = "  accessed from any other threads. After capturing the session_state holds a snapshot"]
    #[doc = "  of the current Link Session State, so it should be used in a local scope. The"]
    #[doc = "  session_state should not be created on the audio thread."]
    pub fn abl_link_capture_audio_session_state(
        link: abl_link,
        session_state: abl_link_session_state,
    );
}
extern "C" {
    #[doc = " @brief Commit the given Session State to the Link session from the"]
    #[doc = "  audio thread."]
    #[doc = "  Thread-safe: no"]
    #[doc = "  Realtime-safe: yes"]
    #[doc = ""]
    #[doc = "  @discussion This function should ONLY be called in the audio thread. The given"]
    #[doc = "  session_state will replace the current Link state. Modifications will be"]
    #[doc = "  communicated to other peers in the session."]
    pub fn abl_link_commit_audio_session_state(
        link: abl_link,
        session_state: abl_link_session_state,
    );
}
extern "C" {
    #[doc = " @brief Capture the current Link Session State from an application thread."]
    #[doc = "  Thread-safe: no"]
    #[doc = "  Realtime-safe: yes"]
    #[doc = ""]
    #[doc = "  @discussion Provides a mechanism for capturing the Link Session State from an"]
    #[doc = "  application thread (other than the audio thread). After capturing the session_state"]
    #[doc = "  contains a snapshot of the current Link state, so it should be used in a local"]
    #[doc = "  scope."]
    pub fn abl_link_capture_app_session_state(
        link: abl_link,
        session_state: abl_link_session_state,
    );
}
extern "C" {
    #[doc = " @brief Commit the given Session State to the Link session from an"]
    #[doc = "  application thread."]
    #[doc = "  Thread-safe: yes"]
    #[doc = "  Realtime-safe: no"]
    #[doc = ""]
    #[doc = "  @discussion The given session_state will replace the current Link Session State."]
    #[doc = "  Modifications of the Session State will be communicated to other peers in the"]
    #[doc = "  session."]
    pub fn abl_link_commit_app_session_state(link: abl_link, session_state: abl_link_session_state);
}
extern "C" {
    #[doc = " @brief: The tempo of the timeline, in Beats Per Minute."]
    #[doc = ""]
    #[doc = "  @discussion This is a stable value that is appropriate for display to the user. Beat"]
    #[doc = "  time progress will not necessarily match this tempo exactly because of clock drift"]
    #[doc = "  compensation."]
    pub fn abl_link_tempo(session_state: abl_link_session_state) -> f64;
}
extern "C" {
    #[doc = " @brief: Set the timeline tempo to the given bpm value, taking effect at the given"]
    #[doc = "  time."]
    pub fn abl_link_set_tempo(session_state: abl_link_session_state, bpm: f64, at_time: i64);
}
extern "C" {
    #[doc = " @brief: Get the beat value corresponding to the given time for the given quantum."]
    #[doc = ""]
    #[doc = "  @discussion: The magnitude of the resulting beat value is unique to this Link"]
    #[doc = "  client, but its phase with respect to the provided quantum is shared among all"]
    #[doc = "  session peers. For non-negative beat values, the following property holds:"]
    #[doc = "  fmod(beatAtTime(t, q), q) == phaseAtTime(t, q)"]
    pub fn abl_link_beat_at_time(
        session_state: abl_link_session_state,
        time: i64,
        quantum: f64,
    ) -> f64;
}
extern "C" {
    #[doc = " @brief: Get the session phase at the given time for the given quantum."]
    #[doc = ""]
    #[doc = "  @discussion: The result is in the interval [0, quantum). The result is equivalent to"]
    #[doc = "  fmod(beatAtTime(t, q), q) for non-negative beat values. This function is convenient"]
    #[doc = "  if the client application is only interested in the phase and not the beat"]
    #[doc = "  magnitude. Also, unlike fmod, it handles negative beat values correctly."]
    pub fn abl_link_phase_at_time(
        session_state: abl_link_session_state,
        time: i64,
        quantum: f64,
    ) -> f64;
}
extern "C" {
    #[doc = " @brief: Get the time at which the given beat occurs for the given quantum."]
    #[doc = ""]
    #[doc = "  @discussion: The inverse of beatAtTime, assuming a constant tempo."]
    #[doc = "  beatAtTime(timeAtBeat(b, q), q) === b."]
    pub fn abl_link_time_at_beat(
        session_state: abl_link_session_state,
        beat: f64,
        quantum: f64,
    ) -> i64;
}
extern "C" {
    #[doc = " @brief: Attempt to map the given beat to the given time in the context of the given"]
    #[doc = " quantum."]
    #[doc = ""]
    #[doc = "  @discussion: This function behaves differently depending on the state of the"]
    #[doc = "  session. If no other peers are connected, then this abl_link instance is in a"]
    #[doc = "  session by itself and is free to re-map the beat/time relationship whenever it"]
    #[doc = "  pleases. In this case, beatAtTime(time, quantum) == beat after this funtion has been"]
    #[doc = "  called."]
    #[doc = ""]
    #[doc = "  If there are other peers in the session, this abl_link instance should not abruptly"]
    #[doc = "  re-map the beat/time relationship in the session because that would lead to beat"]
    #[doc = "  discontinuities among the other peers. In this case, the given beat will be mapped"]
    #[doc = "  to the next time value greater than the given time with the same phase as the given"]
    #[doc = "  beat."]
    #[doc = ""]
    #[doc = "  This function is specifically designed to enable the concept of \"quantized launch\""]
    #[doc = "  in client applications. If there are no other peers in the session, then an event"]
    #[doc = "  (such as starting transport) happens immediately when it is requested. If there are"]
    #[doc = "  other peers, however, we wait until the next time at which the session phase matches"]
    #[doc = "  the phase of the event, thereby executing the event in-phase with the other peers in"]
    #[doc = "  the session. The client application only needs to invoke this function to achieve"]
    #[doc = "  this behavior and should not need to explicitly check the number of peers."]
    pub fn abl_link_request_beat_at_time(
        session_state: abl_link_session_state,
        beat: f64,
        time: i64,
        quantum: f64,
    );
}
extern "C" {
    #[doc = " @brief: Rudely re-map the beat/time relationship for all peers in a session."]
    #[doc = ""]
    #[doc = "  @discussion: DANGER: This function should only be needed in certain special"]
    #[doc = "  circumstances. Most applications should not use it. It is very similar to"]
    #[doc = "  requestBeatAtTime except that it does not fall back to the quantizing behavior when"]
    #[doc = "  it is in a session with other peers. Calling this function will unconditionally map"]
    #[doc = "  the given beat to the given time and broadcast the result to the session. This is"]
    #[doc = "  very anti-social behavior and should be avoided."]
    #[doc = ""]
    #[doc = "  One of the few legitimate uses of this function is to synchronize a Link session"]
    #[doc = "  with an external clock source. By periodically forcing the beat/time mapping"]
    #[doc = "  according to an external clock source, a peer can effectively bridge that clock into"]
    #[doc = "  a Link session. Much care must be taken at the application layer when implementing"]
    #[doc = "  such a feature so that users do not accidentally disrupt Link sessions that they may"]
    #[doc = "  join."]
    pub fn abl_link_force_beat_at_time(
        session_state: abl_link_session_state,
        beat: f64,
        time: u64,
        quantum: f64,
    );
}
extern "C" {
    #[doc = " @brief: Set if transport should be playing or stopped, taking effect at the given"]
    #[doc = "  time."]
    pub fn abl_link_set_is_playing(
        session_state: abl_link_session_state,
        is_playing: bool,
        time: u64,
    );
}
extern "C" {
    #[doc = " @brief: Is transport playing?"]
    pub fn abl_link_is_playing(session_state: abl_link_session_state) -> bool;
}
extern "C" {
    #[doc = " @brief: Get the time at which a transport start/stop occurs"]
    pub fn abl_link_time_for_is_playing(session_state: abl_link_session_state) -> u64;
}
extern "C" {
    #[doc = " @brief: Convenience function to attempt to map the given beat to the time"]
    #[doc = "  when transport is starting to play in context of the given quantum."]
    #[doc = "  This function evaluates to a no-op if abl_link_is_playing equals false."]
    pub fn abl_link_request_beat_at_start_playing_time(
        session_state: abl_link_session_state,
        beat: f64,
        quantum: f64,
    );
}
extern "C" {
    #[doc = " @brief: Convenience function to start or stop transport at a given time and attempt"]
    #[doc = "  to map the given beat to this time in context of the given quantum."]
    pub fn abl_link_set_is_playing_and_request_beat_at_time(
        session_state: abl_link_session_state,
        is_playing: bool,
        time: u64,
        beat: f64,
        quantum: f64,
    );
}
